#include "lvgl/lv_misc/lv_font.h"

#if USE_LV_FONT_PIXELMIX_7_LATIN_SUP != 0  /*Can be enabled in lv_conf.h*/

/***********************************************************************************
 * pixelmix.ttf 7 px Font in U+0020 ( ) .. U+007f ()  range with 1 bpp
***********************************************************************************/

/*Store the image of the letters (glyph)*/
static const uint8_t pixelmix_7_latin_sup_glyph_bitmap[] = 
{
    /*Unicode: U+00a0 ( ) , Width: 3 */
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00a1 (¡) , Width: 1 */
    0x00,  //.. 
    0x80,  //% 
    0x00,  //. 
    0x80,  //% 
    0x80,  //% 
    0x80,  //% 
    0x80,  //% 
    0x80,  //% 

    /*Unicode: U+00a2 (¢) , Width: 4 */
    0x00,  //..... 
    0x20,  //..%.. 
    0x70,  //.%%%. 
    0xA0,  //%.%.. 
    0xA0,  //%.%.. 
    0x70,  //.%%%. 
    0x20,  //..%.. 
    0x00,  //..... 

    /*Unicode: U+00a3 (£) , Width: 4 */
    0x30,  //..%%
    0x40,  //.%..
    0x40,  //.%..
    0xf0,  //%%%%
    0x40,  //.%..
    0x40,  //.%..
    0xf0,  //%%%%
    0x00,  //....

    /*Unicode: U+00a4 (¤) , Width: 5 */
    0x00,  //.....
    0x88,  //%...%
    0x70,  //.%%%.
    0x50,  //.%.%.
    0x70,  //.%%%.
    0x88,  //%...%
    0x00,  //.....
    0x00,  //.....

    /*Unicode: U+00a5 (¥) , Width: 5 */
    0x88,  //%...% 
    0x88,  //%...% 
    0x50,  //.%.%. 
    0xf8,  //%%%%%
    0x20,  //..%.. 
    0xf8,  //%%%%%
    0x20,  //..%.. 
    0x00,  //.. 

    /*Unicode: U+00a6 (¦) , Width: 1 */
    0x80,  //%
    0x80,  //%
    0x80,  //%
    0x00,  //.
    0x80,  //%
    0x80,  //%
    0x80,  //%
    0x00,  //.

    /*Unicode: U+00a7 (§) , Width: 4 */
    0x00,  //....
    0x70,  //.%%%
    0x80,  //%...
    0xe0,  //%%%.
    0x90,  //%..%
    0x70,  //.%%%
    0x10,  //...%
    0xe0,  //%%%.

    /*Unicode: U+00a8 (¨) , Width: 3 */
    0xa0,  //%.%
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00a9 (©) , Width: 7 */
    0x7c,  //.%%%%%.
    0x82,  //%.....%
    0xba,  //%.%%%.%
    0xa2,  //%.%...%
    0xba,  //%.%%%.%
    0x82,  //%.....%
    0x7c,  //.%%%%%.
    0x00,  //......

    /*Unicode: U+00aa (ª) , Width: 5 */
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //....
    0x00,  //....
    0x00,  //....

    /*Unicode: U+00ab («) , Width: 5 */
    0x00,  //.....
    0x00,  //.....
    0x48,  //.%..%
    0x90,  //%..%.
    0x48,  //.%..%
    0x00,  //.....
    0x00,  //.....
    0x00,  //.....

    /*Unicode: U+00ac (¬) , Width: 5 */
    0x00,  //.....
    0x00,  //.....
    0x00,  //.....
    0xf8,  //%%%%%
    0x08,  //....%
    0x00,  //.....
    0x00,  //.....
    0x00,  //.....

    /*Unicode: U+00ad (­) , Width: 2 */
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0xc0,  //%%
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..

    /*Unicode: U+00ae (®) , Width: 7 */
    0x7c,  //.%%%%%.
    0x82,  //%.....%
    0xb2,  //%.%%..%
    0xb2,  //%.%%..%
    0xaa,  //%.%.%.%
    0x82,  //%.....%
    0x7c,  //.%%%%%.
    0x00,  //......

    /*Unicode: U+00af (¯) , Width: 2 */
    0xc0,  //%%
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..

    /*Unicode: U+00b0 (°) , Width: 3 */
    0x40,  //.%
    0xa0,  //%.%
    0x40,  //.%
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00b1 (±) , Width: 5 */
    0x20,  //..%..
    0x20,  //..%..
    0xf8,  //%%%%% 
    0x20,  //..%..
    0x20,  //..%..
    0x00,  //.....
    0xf8,  //%%%%%
    0x00,  //.....

    /*Unicode: U+00b2 (²) , Width: 3 */
    0xc0,  //%%.
    0x20,  //..%.
    0x40,  //.%.
    0x80,  //%..
    0xe0,  //%%%
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00b3 (³) , Width: 3 */
    0xc0,  //%%
    0x20,  //..%
    0xc0,  //%%
    0x20,  //..%
    0xc0,  //%%
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00b4 (´) , Width: 2 */
    0x40,  //.%
    0x80,  //%.
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..

    /*Unicode: U+00b5 (µ) , Width: 5 */
    0x00,  //.....
    0x00,  //.....
    0x90,  //%..%.
    0x90,  //%..%.
    0x90,  //%..%.
    0xe8,  //%%%.% 
    0x80,  //%.....
    0x80,  //%.....

    /*Unicode: U+00b6 (¶) , Width: 5 */
    0x78,  //.%%%%
    0xe8,  //%%%.%
    0x78,  //.%%%%
    0x28,  //..%.%
    0x28,  //..%.%
    0x28,  //..%.%
    0x28,  //..%.%
    0x00,  //.....

    /*Unicode: U+00b7 (·) , Width: 1 */
    0x00,  //.
    0x00,  //.
    0x00,  //.
    0x80,  //%
    0x00,  //.
    0x00,  //.
    0x00,  //.
    0x00,  //.

    /*Unicode: U+00b8 (¸) , Width: 2 */
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x00,  //..
    0x40,  //.%
    0xc0,  //%%

    /*Unicode: U+00b9 (¹) , Width: 3 */
    0xc0,  //%%.
    0x40,  //.%.
    0x40,  //.%.
    0x40,  //.%.
    0xe0,  //%%%
    0x00,  //..
    0x00,  //..
    0x00,  //..

    /*Unicode: U+00ba (º) , Width: 3 */
    0x40,  //.%
    0xa0,  //%.%
    0x40,  //.%
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...
    0x00,  //...

    /*Unicode: U+00bb (») , Width: 5 */
    0x00,  //.....
    0x00,  //.....
    0x90,  //%..%.
    0x48,  //.%..%
    0x90,  //%..%.
    0x00,  //.....
    0x00,  //.....
    0x00,  //.....

    /*Unicode: U+00bc (¼) , Width: 8 */
    0xc1,  //%%.....%
    0x42,  //.%....%.
    0x44,  //.%...%..
    0xe8,  //%%%.%...
    0x15,  //...%.%.%
    0x25,  //..%..%.%
    0x47,  //.%...%%%
    0x81,  //%......%

    /*Unicode: U+00bd (½) , Width: 8 */
    0xc1,  //%%.....%
    0x42,  //.%....%.
    0x44,  //.%...%..
    0xe8,  //%%%.%...
    0x16,  //...%.%%.
    0x21,  //..%....%
    0x42,  //.%....%.
    0x87,  //%....%%%

    /*Unicode: U+00be (¾) , Width: 8 */
    0xc0,  //%%.....%
    0x22,  //..%...%.
    0xc4,  //%%...%..
    0x28,  //..%.%...
    0xd5,  //%%.%.%.%
    0x25,  //..%..%.%
    0x47,  //.%...%%%
    0x81,  //%......%

    /*Unicode: U+00bf (¿) , Width: 4 */
    0x00,  //....
    0x20,  //..%.. 
    0x00,  //.... 
    0x20,  //..%.. 
    0x40,  //.%.. 
    0x80,  //%...
    0x90,  //%..% 
    0x60,  //.%%. 

    /*Unicode: U+00c0 (À) , Width: 5 */
    0x20,  //..%..
    0x10,  //...%.
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //..... 

    /*Unicode: U+00c1 (Á) , Width: 5 */
    0x20,  //..%..
    0x40,  //.%...
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //..... 

    /*Unicode: U+00c2 (Â) , Width: 5 */
    0x20,  //..%..
    0x50,  //.%.%.
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //..... 

    /*Unicode: U+00c4 (Ä) , Width: 5 */
    0x50,  //.%.%.
    0x00,  //.....
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //..... 

    /*Unicode: U+00c5 (Å) , Width: 5 */
    0x20,  //..%.. 
    0x00,  //.....
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //..... 
 
    /*Unicode: U+00c6 (Æ) , Width: 7 */
    0x1e,  //...%%%%. 
    0x28,  //..%.%...
    0x28,  //..%.%...
    0x4e,  //.%..%%%.
    0x78,  //.%%%%...
    0x88,  //%...%...
    0x8e,  //%...%%%.
    0x00,  //........

    /*Unicode: U+00c7 (Ç) , Width: 5 */
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x80,  //%.... 
    0x80,  //%.... 
    0x80,  //%.... 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x20,  //..%.. 

    /*Unicode: U+00c8 (È) , Width: 4 */
    0x40,  //.%..
    0x20,  //..%.
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x00,  //....

    /*Unicode: U+00c9 (É) , Width: 4 */
    0x20,  //..%.
    0x40,  //.%..
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x00,  //....

    /*Unicode: U+00ca (Ê) , Width: 4 */
    0x20,  //..%.
    0x50,  //.%.%
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x00,  //....

    /*Unicode: U+00cb (Ë) , Width: 4 */
    0x50,  //.%.%
    0x00,  //....
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x80,  //%... 
    0xf0,  //%%%% 
    0x00,  //....

    /*Unicode: U+00cc (Ì) , Width: 3 */
    0x40,  //.%. 
    0x20,  //..% 
    0xe0,  //%%% 
    0x40,  //.%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00cd (Í) , Width: 3 */
    0x40,  //.%. 
    0x80,  //%.. 
    0xe0,  //%%% 
    0x40,  //.%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00ce (Î) , Width: 3 */
    0x40,  //.%. 
    0xa0,  //%.% 
    0xe0,  //%%% 
    0x40,  //.%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00cf (Ï) , Width: 3 */
    0xa0,  //%.% 
    0x00,  //... 
    0xe0,  //%%% 
    0x40,  //.%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00d0 (Ð) , Width: 6 */
    0x78,  //.%%%%... 
    0x44,  //.%...%..
    0x44,  //.%...%..
    0xe4,  //%%%..%.. 
    0x44,  //.%...%..
    0x44,  //.%...%..
    0x78,  //.%%%%... 
    0x00,  //.. .....

    /*Unicode: U+00d1 (Ñ) , Width: 5 */
    0x28,  //..%.% 
    0x50,  //.%.%. 
    0x88,  //%...% 
    0xc8,  //%%..% 
    0xa8,  //%.%.% 
    0x98,  //%..%% 
    0x88,  //%...% 
    0x00,  //.. 

    /*Unicode: U+00d2 (Ò) , Width: 5 */
    0x20,  //..%..
    0x10,  //...%.
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00d3 (Ó) , Width: 5 */
    0x20,  //..%..
    0x40,  //.%...
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00d4 (Ô) , Width: 5 */
    0x20,  //..%..
    0x50,  //.%.%.
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00d5 (Õ) , Width: 5 */
    0x28,  //..%.%
    0x50,  //.%.%.
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00d6 (Ö) , Width: 5 */
    0x50,  //.%.%.
    0x00,  //.....
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00d7 (×) , Width: 5 */
    0x00,  //..... 
    0x00,  //..... 
    0x88,  //%...% 
    0x50,  //.%.%. 
    0x20,  //..%.. 
    0x50,  //.%.%. 
    0x88,  //%...% 
    0x00,  //.. 

    /*Unicode: U+00d8 (Ø) , Width: 7 */
    0x3a,  //..%%%.%. 
    0x44,  //.%...%..
    0x4c,  //.%..%%..
    0x54,  //.%.%.%..
    0x64,  //.%%..%..
    0x44,  //.%...%..
    0xb8,  //%.%%%...
    0x00,  //........

    /*Unicode: U+00d9 (Ù) , Width: 5 */
    0x40,  //.%..
    0x20,  //..%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00da (Ú) , Width: 4 */
    0x10,  //...%.
    0x20,  //..%.. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00db (Û) , Width: 4 */
    0x20,  //..%..
    0x50,  //.$.%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00dc (Ü) , Width: 4 */
    0x50,  //.%.%.
    0x00,  //..... 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00dd (Ý) , Width: 5 */
    0x10,  //...%.
    0x20,  //..%..
    0x88,  //%...% 
    0x88,  //%...% 
    0x50,  //.%.%. 
    0x20,  //..%.. 
    0x20,  //..%.. 
    0x00,  //.. 

    /*Unicode: U+00de (Þ) , Width: 5 */
    0x80,  //%...
    0x80,  //%...
    0xf0,  //%%%%.
    0x88,  //%...% 
    0x88,  //%...% 
    0xf0,  //%%%%.
    0x80,  //%...
    0x80,  //%...

    /*Unicode: U+00df (ß) , Width: 5 */
    0x70,  //.%%%.
    0x88,  //%...%
    0x90,  //%..%.
    0xf0,  //%%%%.
    0x88,  //%...%
    0x88,  //%...%
    0xf0,  //%%%%.
    0x80,  //%....

    /*Unicode: U+00e0 (à) , Width: 5 */
    0x20,  //..%.. 
    0x10,  //...%. 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e1 (á) , Width: 5 */
    0x20,  //..%.. 
    0x40,  //.%... 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e2 (â) , Width: 5 */
    0x20,  //..%.. 
    0x50,  //.$.%. 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e3 (ã) , Width: 5 */
    0x28,  //..%.% 
    0x50,  //.%.%. 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e4 (ä) , Width: 5 */
    0x50,  //.%.%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e5 (å) , Width: 5 */
    0x20,  //..%.. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x00,  //..... 

    /*Unicode: U+00e6 (æ) , Width: 8 */
    0x00,  //........
    0x00,  //........
    0x76,  //.%%%.%%.
    0x09,  //....%..%
    0x7f,  //.%%%%%%%
    0x88,  //%...%...
    0x7f,  //.%%%%%%%
    0x00,  //........ 


    /*Unicode: U+00e7 (ç) , Width: 4 */
    0x00,  //.... 
    0x00,  //.... 
    0x70,  //.%%% 
    0x80,  //%... 
    0x80,  //%... 
    0x80,  //%... 
    0x70,  //.%%% 
    0x20,  //..%.

    /*Unicode: U+00e8 (è) , Width: 5 */
    0x20,  //..%.. 
    0x10,  //...%. 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x80,  //%.... 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00e9 (é) , Width: 5 */
    0x20,  //..%.. 
    0x40,  //.%... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x80,  //%.... 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00ea (ê) , Width: 5 */
    0x20,  //..%.. 
    0x50,  //.%.%. 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x80,  //%.... 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00eb (ë) , Width: 5 */
    0x50,  //.%.%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0xf8,  //%%%%% 
    0x80,  //%.... 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00ec (ì) , Width: 3 */
    0x80,  //%..
    0x40,  //.%. 
    0x00,  //... 
    0xc0,  //%%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00ed (í) , Width: 3 */
    0x20,  //..%
    0x40,  //.%. 
    0x00,  //... 
    0xc0,  //%%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00ee (î) , Width: 3 */
    0x40,  //.%. 
    0xa0,  //%.%
    0x00,  //... 
    0xc0,  //%%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00ef (ï) , Width: 3 */
    0x00,  //... 
    0xa0,  //%.%
    0x00,  //... 
    0xc0,  //%%. 
    0x40,  //.%. 
    0x40,  //.%. 
    0xe0,  //%%% 
    0x00,  //.. 

    /*Unicode: U+00f0 (ð) , Width: 5 */
    0x68,  //.%%.%
    0x10,  //...%. 
    0x28,  //..%.% 
    0x08,  //....% 
    0x78,  //.%%%% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f1 (ñ) , Width: 5 */
    0x28,  //..%.%
    0x50,  //.%.%. 
    0x00,  //..... 
    0xb0,  //%.%%. 
    0xc8,  //%%..% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x00,  //.. 

    /*Unicode: U+00f2 (ò) , Width: 4 */
    0x20,  //..%.. 
    0x10,  //...%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f3 (ó) , Width: 4 */
    0x20,  //..%.. 
    0x40,  //.%... 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f4 (ô) , Width: 4 */
    0x20,  //..%.. 
    0x50,  //.%.%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f5 (õ) , Width: 4 */
    0x28,  //..%.%
    0x50,  //.%.%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f6 (ö) , Width: 4 */
    0x00,  //..... 
    0x50,  //.%.%. 
    0x00,  //..... 
    0x70,  //.%%%. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00f7 (÷) , Width: 5 */
    0x00,  //..... 
    0x20,  //..%.. 
    0x00,  //..... 
    0xf8,  //%%%%% 
    0x00,  //..... 
    0x20,  //..%.. 
    0x00,  //..... 
    0x00,  //..... 

    /*Unicode: U+00f8 (ø) , Width: 7 */
    0x00,  //........
    0x02,  //......%.
    0x34,  //..%%.%..
    0x48,  //.%..%...
    0x54,  //.%.%.%..
    0x24,  //..%..%..
    0x58,  //.%.%%...
    0x80,  //%.......

    /*Unicode: U+00f9 (ù) , Width: 5 */
    0x40,  //.%..
    0x20,  //..%. 
    0x00,  //.. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00fa (ú) , Width: 5 */
    0x10,  //...%.
    0x20,  //..%.. 
    0x00,  //..... 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00fb (û) , Width: 5 */
    0x20,  //..%..
    0x50,  //.$.%. 
    0x00,  //..... 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00fc (ü) , Width: 5 */
    0x00,  //..... 
    0x50,  //.%.%.
    0x00,  //..... 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x70,  //.%%%. 
    0x00,  //.. 

    /*Unicode: U+00fd (ý) , Width: 5 */
    0x10,  //...%.
    0x20,  //..%.. 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x08,  //....% 
    0x70,  //.%%%. 

    /*Unicode: U+00fe (þ) , Width: 5 */
    0x80,  //%...
    0x80,  //%...
    0xb0,  //%.%%.
    0xc8,  //%%..% 
    0x88,  //%...% 
    0xf0,  //%%%%.
    0x80,  //%...
    0x80,  //%...

    /*Unicode: U+00ff (ÿ) , Width: 5 */
    0x50,  //.%.%.
    0x00,  //..... 
    0x88,  //%...% 
    0x88,  //%...% 
    0x88,  //%...% 
    0x78,  //.%%%% 
    0x08,  //....% 
    0x70,  //.%%%. 

};

/*Store the glyph descriptions*/
static const lv_font_glyph_dsc_t pixelmix_7_latin_sup_glyph_dsc[] = 
{
    {.w_px = 3, .glyph_index = 0},  /*Unicode: U+00a0 ( )*/
    {.w_px = 1, .glyph_index = 8},  /*Unicode: U+00a1 (¡)*/
    {.w_px = 4, .glyph_index = 16},  /*Unicode: U+00a2 (¢)*/
    {.w_px = 4, .glyph_index = 24},  /*Unicode: U+00a3 (£)*/
    {.w_px = 5, .glyph_index = 32},  /*Unicode: U+00a4 (¤)*/
    {.w_px = 5, .glyph_index = 40},  /*Unicode: U+00a5 (¥)*/
    {.w_px = 1, .glyph_index = 48},  /*Unicode: U+00a6 (¦)*/
    {.w_px = 4, .glyph_index = 56},  /*Unicode: U+00a7 (§)*/
    {.w_px = 3, .glyph_index = 64},  /*Unicode: U+00a8 (¨)*/
    {.w_px = 7, .glyph_index = 72},  /*Unicode: U+00a9 (©)*/
    {.w_px = 5, .glyph_index = 80},  /*Unicode: U+00aa (ª)*/
    {.w_px = 5, .glyph_index = 88},  /*Unicode: U+00ab («)*/
    {.w_px = 5, .glyph_index = 96},  /*Unicode: U+00ac (¬)*/
    {.w_px = 2, .glyph_index = 104},  /*Unicode: U+00ad (­)*/
    {.w_px = 7, .glyph_index = 112},  /*Unicode: U+00ae (®)*/
    {.w_px = 2, .glyph_index = 120},  /*Unicode: U+00af (¯)*/
    {.w_px = 3, .glyph_index = 128},  /*Unicode: U+00b0 (°)*/
    {.w_px = 5, .glyph_index = 136},  /*Unicode: U+00b1 (±)*/
    {.w_px = 3, .glyph_index = 144},  /*Unicode: U+00b2 (²)*/
    {.w_px = 3, .glyph_index = 152},  /*Unicode: U+00b3 (³)*/
    {.w_px = 2, .glyph_index = 160},  /*Unicode: U+00b4 (´)*/
    {.w_px = 5, .glyph_index = 168},  /*Unicode: U+00b5 (µ)*/
    {.w_px = 5, .glyph_index = 176},  /*Unicode: U+00b6 (¶)*/
    {.w_px = 1, .glyph_index = 184},  /*Unicode: U+00b7 (·)*/
    {.w_px = 2, .glyph_index = 192},  /*Unicode: U+00b8 (¸)*/
    {.w_px = 3, .glyph_index = 200},  /*Unicode: U+00b9 (¹)*/
    {.w_px = 3, .glyph_index = 208},  /*Unicode: U+00ba (º)*/
    {.w_px = 5, .glyph_index = 216},  /*Unicode: U+00bb (»)*/
    {.w_px = 8, .glyph_index = 224},  /*Unicode: U+00bc (¼)*/
    {.w_px = 8, .glyph_index = 232},  /*Unicode: U+00bd (½)*/
    {.w_px = 8, .glyph_index = 240},  /*Unicode: U+00be (¾)*/
    {.w_px = 4, .glyph_index = 248},  /*Unicode: U+00bf (¿)*/
    {.w_px = 5, .glyph_index = 256},  /*Unicode: U+00c0 (À)*/
    {.w_px = 5, .glyph_index = 264},  /*Unicode: U+00c1 (Á)*/
    {.w_px = 5, .glyph_index = 272},  /*Unicode: U+00c2 (Â)*/
    {.w_px = 5, .glyph_index = 280},  /*Unicode: U+00c4 (Ä)*/
    {.w_px = 5, .glyph_index = 288},  /*Unicode: U+00c5 (Å)*/
    {.w_px = 7, .glyph_index = 296},  /*Unicode: U+00c6 (Æ)*/
    {.w_px = 5, .glyph_index = 304},  /*Unicode: U+00c7 (Ç)*/
    {.w_px = 4, .glyph_index = 312},  /*Unicode: U+00c8 (È)*/
    {.w_px = 4, .glyph_index = 320},  /*Unicode: U+00c9 (É)*/
    {.w_px = 4, .glyph_index = 328},  /*Unicode: U+00ca (Ê)*/
    {.w_px = 4, .glyph_index = 336},  /*Unicode: U+00cb (Ë)*/
    {.w_px = 3, .glyph_index = 344},  /*Unicode: U+00cc (Ì)*/
    {.w_px = 3, .glyph_index = 352},  /*Unicode: U+00cd (Í)*/
    {.w_px = 3, .glyph_index = 360},  /*Unicode: U+00ce (Î)*/
    {.w_px = 3, .glyph_index = 368},  /*Unicode: U+00cf (Ï)*/
    {.w_px = 6, .glyph_index = 376},  /*Unicode: U+00d0 (Ð)*/
    {.w_px = 5, .glyph_index = 384},  /*Unicode: U+00d1 (Ñ)*/ 
    {.w_px = 5, .glyph_index = 392},  /*Unicode: U+00d2 (Ò)*/ 
    {.w_px = 5, .glyph_index = 400},  /*Unicode: U+00d3 (Ó)*/ 
    {.w_px = 5, .glyph_index = 408},  /*Unicode: U+00d4 (Ô)*/ 
    {.w_px = 5, .glyph_index = 416},  /*Unicode: U+00d5 (Õ)*/ 
    {.w_px = 5, .glyph_index = 424},  /*Unicode: U+00d6 (Ö)*/ 
    {.w_px = 5, .glyph_index = 432},  /*Unicode: U+00d7 (×)*/ 
    {.w_px = 7, .glyph_index = 440},  /*Unicode: U+00d8 (Ø)*/ 
    {.w_px = 5, .glyph_index = 448},  /*Unicode: U+00d9 (Ù)*/ 
    {.w_px = 5, .glyph_index = 456},  /*Unicode: U+00da (Ú)*/ 
    {.w_px = 5, .glyph_index = 464},  /*Unicode: U+00db (Û)*/ 
    {.w_px = 5, .glyph_index = 472},  /*Unicode: U+00dc (Ü)*/ 
    {.w_px = 7, .glyph_index = 480},  /*Unicode: U+00dd (Ý)*/ 
    {.w_px = 5, .glyph_index = 488},  /*Unicode: U+00de (Þ)*/ 
    {.w_px = 5, .glyph_index = 496},  /*Unicode: U+00df (ß)*/ 
    {.w_px = 5, .glyph_index = 504},  /*Unicode: U+00e0 (à)*/ 
    {.w_px = 5, .glyph_index = 512},  /*Unicode: U+00e1 (á)*/ 
    {.w_px = 5, .glyph_index = 520},  /*Unicode: U+00e2 (â)*/ 
    {.w_px = 5, .glyph_index = 528},  /*Unicode: U+00e3 (ã)*/ 
    {.w_px = 5, .glyph_index = 536},  /*Unicode: U+00e4 (ä)*/ 
    {.w_px = 5, .glyph_index = 544},  /*Unicode: U+00e5 (å)*/ 
    {.w_px = 8, .glyph_index = 552},  /*Unicode: U+00e6 (æ)*/ 
    {.w_px = 4, .glyph_index = 560},  /*Unicode: U+00e7 (ç)*/ 
    {.w_px = 5, .glyph_index = 568},  /*Unicode: U+00e8 (è)*/ 
    {.w_px = 5, .glyph_index = 576},  /*Unicode: U+00e9 (é)*/ 
    {.w_px = 5, .glyph_index = 584},  /*Unicode: U+00ea (ê)*/ 
    {.w_px = 5, .glyph_index = 592},  /*Unicode: U+00eb (ë)*/ 
    {.w_px = 3, .glyph_index = 600},  /*Unicode: U+00ec (ì)*/ 
    {.w_px = 3, .glyph_index = 608},  /*Unicode: U+00ed (í)*/ 
    {.w_px = 3, .glyph_index = 616},  /*Unicode: U+00ee (î)*/ 
    {.w_px = 3, .glyph_index = 624},  /*Unicode: U+00ef (ï)*/ 
    {.w_px = 5, .glyph_index = 632},  /*Unicode: U+00f0 (ð)*/ 
    {.w_px = 5, .glyph_index = 640},  /*Unicode: U+00f1 (ñ)*/ 
    {.w_px = 5, .glyph_index = 648},  /*Unicode: U+00f2 (ò)*/ 
    {.w_px = 5, .glyph_index = 656},  /*Unicode: U+00f3 (ó)*/ 
    {.w_px = 5, .glyph_index = 664},  /*Unicode: U+00f4 (ô)*/ 
    {.w_px = 5, .glyph_index = 672},  /*Unicode: U+00f5 (õ)*/ 
    {.w_px = 5, .glyph_index = 680},  /*Unicode: U+00f6 (ö)*/ 
    {.w_px = 5, .glyph_index = 688},  /*Unicode: U+00f7 (÷)*/ 
    {.w_px = 7, .glyph_index = 696},  /*Unicode: U+00f8 (ø)*/ 
    {.w_px = 5, .glyph_index = 704},  /*Unicode: U+00f9 (ù)*/ 
    {.w_px = 5, .glyph_index = 712},  /*Unicode: U+00fa (ú)*/ 
    {.w_px = 5, .glyph_index = 720},  /*Unicode: U+00fb (û)*/ 
    {.w_px = 5, .glyph_index = 728},  /*Unicode: U+00fc (ü)*/ 
    {.w_px = 5, .glyph_index = 736},  /*Unicode: U+00fd (ý)*/ 
    {.w_px = 5, .glyph_index = 744},  /*Unicode: U+00fe (þ)*/ 
    {.w_px = 5, .glyph_index = 752},  /*Unicode: U+00ff (ÿ)*/ 
};

lv_font_t lv_font_pixelmix_7_latin_sup = 
{
    .unicode_first = 160,   /*First Unicode letter in this font*/
    .unicode_last = 255,    /*Last Unicode letter in this font*/
    .h_px = 8,              /*Font height in pixels*/
    .glyph_bitmap = pixelmix_7_latin_sup_glyph_bitmap,  /*Bitmap of glyphs*/
    .glyph_dsc = pixelmix_7_latin_sup_glyph_dsc,        /*Description of glyphs*/
    .glyph_cnt = 96,            /*Number of glyphs in the font*/
    .unicode_list = NULL,   /*Every character in the font from 'unicode_first' to 'unicode_last'*/
    .get_bitmap = lv_font_get_bitmap_continuous,    /*Function pointer to get glyph's bitmap*/
    .get_width = lv_font_get_width_continuous,  /*Function pointer to get glyph's width*/
    .bpp = 1,               /*Bit per pixel*/
    .monospace = 0,             /*Fix width (0: if not used)*/
    .next_page = NULL,      /*Pointer to a font extension*/
};

#endif
